# This is a sample Jupyter Notebook

Below is an example of a code cell. 
Put your cursor into the cell and press Shift+Enter to execute it and select the next one, or click 'Run Cell' button.

Press Double Shift to search everywhere for classes, files, tool windows, actions, and settings.

To learn more about Jupyter Notebooks in PyCharm, see [help](https://www.jetbrains.com/help/pycharm/ipython-notebook-support.html).
For an overview of PyCharm, go to Help -> Learn IDE features or refer to [our documentation](https://www.jetbrains.com/help/pycharm/getting-started.html).

# Import Pandas

In [8]:
import pandas as pd

# Create and view a series of three different colours

In [9]:
colors=pd.Series(["red","green","blue"])
colors

0      red
1    green
2     blue
dtype: object

# Create a series of three different car types and view it

In [10]:
car=pd.Series(["suv","convertible","sedan"])
car

0            suv
1    convertible
2          sedan
dtype: object

# Combine the Series of cars and colours into a DataFrame

In [11]:
combine = pd.DataFrame({
    "cat_type":car,
    "color":colors
})
combine

      cat_type  color
0          suv    red
1  convertible  green
2        sedan   blue

# Import "../data/car-sales.csv" and turn it into a DataFrame

In [14]:
car_sales=pd.read_csv("data/car-sales.csv")
car=pd.DataFrame(car_sales)
car

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00